
// 각 테스트케이스(it)가 수행되기 전에 한 번씩 실행되는 코드
beforeEach(() => {
  // 페이지 접속
  cy.visit('http://localhost:5173')
  
})

afterEach(() => {
  console.log('자원 해제 처리'); // Cleanup 처리
})

describe('할일 등록 기능', () => {

  it.skip('할일 등록 버튼을 클릭할 경우, 할일 등록 폼 Modal이 활성화된다.', () => {
    // 테스트 코드 로직 작성 부분
    
    // 할일 등록 버튼 클릭하기
    // cy.get() -> 페이지 내 특정 엘리먼트를 가져오기
    cy.get('[data-cy="add-todo-button"]')
      .click();
    // -> 해당 버튼을 마우스 클릭해라

    // Modal 창이 정상적으로 활성화되었는지 확인하는 방법??
    const expected = '할일 등록';

    cy.get('[data-cy="todo-form-title"]')
    .should('have.text', expected)
    // -> 테스트는 기본적으로 
    // it()에 작성된 '테스트 시나리오에 대한 검증용 코드'가 작성이 되어있어야 함
    // ex. assert(), expect(), ...
  });

  it('할 일이 등록되면 할 일 목록에 등록한 새로운 할 일이 추가되어 표시된다.', () => {
    // 할일 등록 버튼 클릭
    cy.get('[data-cy="add-todo-button"]').click();

    // 할일 입력 및 등록 액션 수행
    cy.get('#title').type('실기 문제풀기');
    cy.wait(500);
    cy.get('#summary').type('실기 평가를 통과한다.. 제발!!');
    cy.wait(500);

    // 할일 추가 되었는지 확인
    cy.get('[data-cy="process-add-or-update"]').click();
    cy.wait(1000);
    cy.contains('실기 문제풀기').should('exist');
  })
})

describe('할일 필터링 기능', () => {
    it('TODO 필터 선택 시 :책갈피_탭: 아이콘이 있는 항목만 보여야 한다.', () => {
        cy.get('[data-cy="todo-filter"]').select('TODO');
        cy.get('[data-cy="todo-item"]').each(($el) => {
            cy.wrap($el).should('contain.text', '📑');
        });
    });
    // 그 외 다른 카테고리는 생략
});

describe('할일 삭제 기능', () => {
    it('특정 할일의 휴지통 버튼을 클릭할 경우, 선택된 할일이 제거된다.', () => {
        // 삭제 전: 해당 제목이 존재해야 함
        cy.contains('[data-cy="todo-item"]', '점심 먹기').should('exist');

        cy.contains('[data-cy="todo-item"]', '점심 먹기')
            .find('[data-cy="recycle-bin"]')
            .click();

        cy.contains('[data-cy="todo-item"]', '점심 먹기').should('not.exist');
    })
});